InformationRegisters/ДанныеПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыКомплекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БезГабаритногоЧертежа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЗамера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГантКонструктораОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГОСТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияКонструктора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Код_в_PDM</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДоработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИзменение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКорректировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НормаВремени_ТЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РКД_отдельно_от_композиции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СогласованДизайнером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокМонтажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроектирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПроизводства</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКомплекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКомплектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоДоработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоРекламация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/омВыгрузкаCRMНаСевере/Ext/Module.bsl
Функция ПроверитьВыгрузкуНаСервере(ОбъектВыгрузки, ВозвратСтуктуры = Ложь, ВБитрикс = Ложь) Экспорт
	
	стРезультат = Новый Структура("ВыгруженВPDM", Ложь);
	
	ВБитрикс = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
	|ИЗ
	|	РегистрСведений.%ДатыКомплекта% КАК ДатыКомплекта
	|ГДЕ
	|	ДатыКомплекта.%Комплект% = &ОбъектВыгрузки
	|";
	
	
	ТипОбъекта = ТипЗнч(ОбъектВыгрузки);
	
	Если ТипОбъекта = тип("СправочникСсылка.ИзделияКомплект") ИЛИ ТипОбъекта = Тип("СправочникСсылка.Композиции")  Тогда
	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ДатыКомплекта%", "ДатыКомплекта");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Комплект%", "Комплект");	
	
	ИначеЕсли ТипОбъекта = тип("СправочникСсылка.ГабаритныеЧертежи") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ДатыКомплекта%", "ДанныеГабаритныйЧертеж");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Комплект%", "ГабаритныйЧертеж");	
	
	ИначеЕсли ТипОбъекта = тип("СправочникСсылка.Проекты") Тогда
		
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ДатыКомплекта%", "ДанныеПроекта");	
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Комплект%", "Проект");	
	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ОбъектВыгрузки", ОбъектВыгрузки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КодПДМ 		= Неопределено;
	
	Пока Выборка.Следующий() Цикл
		КодПДМ = Выборка.Код_в_PDM;
	КонецЦикла;
	
	
	Если ВозвратСтуктуры Тогда
		
		стРезультат.ВыгруженВPDM = ЗначениеЗаполнено(КодПДМ);
		
		Возврат стРезультат;
	КонецЕсли;
	

	Возврат НЕ (КодПДМ = Неопределено );
	
КонецФункции // ПроверитьВыгрузкуНаСервере()

Функция ВыгрузитьВБитриксРегламентноеЗадание(Источник = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	стВозврата = Новый Структура("ОписаниеОшибки,РезультатаВыгрузки","","");

	Если омВыгрузкаCRMНаСевереПовтор.ЗапретВыгрузкиВБитрикс() Тогда
		
		стВозврата.ОписаниеОшибки = "Запрет выгрузки в битрикс.";
		Возврат стВозврата;
		
	КонецЕсли;
	
	ИменаИспользуемыхРеглЗаданий	= Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьИменаИспользуемыхРеглЗаданий();
	НаименованиеФоновогоЗадания 	= ИменаИспользуемыхРеглЗаданий.ВыгрузкаВРежимеРВСМ;
	Если Б24_К_ОбщегоНазначенияВызовСервера.СейчасВыполняетсяЗадание(НаименованиеФоновогоЗадания) Тогда
		
		стВозврата.ОписаниеОшибки = "Фоновое задание уже выполняется.";
		Возврат стВозврата;
		
	КонецЕсли;
		
	Если НЕ Источник = Неопределено Тогда
		Отказ = Ложь;
		Б24_СМ_РегистрацияИзмененийСервер.ЗарегистрироватьИзменения(Источник, Ложь, Отказ);
		Если Отказ Тогда
			
			стВозврата.ОписаниеОшибки = "Не удалось зарегистрировать объект " + Источник;
			Возврат стВозврата;
			
		КонецЕсли;
		
	КонецЕсли;
	
	НастройкаПодключения =  Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(Константы.НастройкаПодключенияКБитриксПоУмолчанию.Получить());  
	Если НастройкаПодключения = Неопределено Тогда
		
		стВозврата.ОписаниеОшибки = "Не настроен обмен с битрикс.";
		Возврат стВозврата;
		
	КонецЕсли;

	ПараметрыСинхронизации = Новый Структура("ВидСинхронизации, ВыполнятьВыгрузку, ВыполнятьЗагрузку, ПолнаяСинхронизация, НастройкаПодключения"
										    , 1,			    Истина, 		   Истина, 			  Ложь, 			   НастройкаПодключения);
	
	АдресРезультата = Неопределено;
	Б24_КС_ОбщегоНазначенияВызовСервера.ВыполнитьСинхронизациюПоФоновомуЗаданию(ПараметрыСинхронизации, АдресРезультата);	
	
	НастройкаПодключения =  Б24_СМ_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(Константы.НастройкаПодключенияКБитриксПоУмолчанию.Получить());  
	Если НастройкаПодключения = Неопределено Тогда
		
		стВозврата.ОписаниеОшибки = "Не настроен обмен с битрикс.";
		Возврат стВозврата;
		
	КонецЕсли;
	
	НастройкаПодключения.ИгнорироватьОшибкиВоВремяСинхронизации = Истина;

	ПараметрыСинхронизации = Новый Структура("ВидСинхронизации, ВыполнятьВыгрузку, ВыполнятьЗагрузку, ПолнаяСинхронизация, НастройкаПодключения"
										    , 1,			    Истина, 		   Истина, 			  Ложь, 			   НастройкаПодключения);
 	Б24_СМ_ОбщегоНазначенияВызовСервера.ВыполнитьСинхронизациюПоФоновомуЗаданию(ПараметрыСинхронизации, АдресРезультата);
КонецФункции // ВыгрузитьВБитрикс() 

Функция ПолучитьНаименованиеНастроек() Экспорт 
	
	мНаименованиеНастроек = Новый Массив(11);
	мНаименованиеНастроек[0] 	= "ПутьКФайлуEXE";	
	мНаименованиеНастроек[1] 	= "ПутьКФайлуЗагрузки";	
	мНаименованиеНастроек[2] 	= "ПутьКФайлуEXEПроекта";	
	мНаименованиеНастроек[3] 	= "ПутьКФайлуEXEКонструктор";	
	мНаименованиеНастроек[4] 	= "ПутьКФайлуEXEКомпозиция";	
	мНаименованиеНастроек[5] 	= "ПутьКФайлуEXEГабаритныйЧерчеж";	
	мНаименованиеНастроек[6] 	= "ПутьКФайлуEXEИзменениеСтатусаГЧ";	
	мНаименованиеНастроек[7] 	= "ПутьКФайлуEXEЗагрузкаТЗ";	
	мНаименованиеНастроек[8] 	= "ПутьКФайлуEXEРаздатьПрава";	
	мНаименованиеНастроек[9] 	= "ПутьКФайлуEXEЗабратьПрава";	
	мНаименованиеНастроек[10] 	= "ПутьКФайлуEXEЕстьРазрегестрированные";	
	
	Возврат мНаименованиеНастроек;
	
КонецФункции // ПолучитьНаименованиеНастроек()    

Функция ПолучитьДанныеЭлемента(ЭлементВыгрузки, ТипВыгрузки, ПараметрыВыгрузки) Экспорт
	
	ТипСтрока 		= Новый ОписаниеТипов("Строка");
	тзДанные 		= Новый ТаблицаЗначений; 
	ОписаниеОшибки 	= "";
	
	Если ТипВыгрузки = "Проект" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Проекты.Номер КАК НомерПроекта,
		|	Проекты.Префикс КАК Префикс,
		|	Проекты.Наименование КАК НаименованиеПроекта,
		|	Проекты.Код КАК Код1С,
		|	ЕСТЬNULL(ДанныеПроекта.Код_в_PDM, 0) КАК ID_PDM
		|ИЗ
		|	Справочник.Проекты КАК Проекты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроекта КАК ДанныеПроекта
		|		ПО (ДанныеПроекта.Проект = Проекты.Ссылка)
		|ГДЕ
		|	Проекты.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		тзДанные.Колонки.Добавить("НомерПроекта", 			ТипСтрока); 
		тзДанные.Колонки.Добавить("НаименованиеПроекта", 	ТипСтрока); 
		тзДанные.Колонки.Добавить("СуффикПроекта", 			ТипСтрока); 
		тзДанные.Колонки.Добавить("ID_PDM", 				ТипСтрока); 
		тзДанные.Колонки.Добавить("Код1С", 					ТипСтрока); 
		
		Пока Выборка.Следующий() Цикл
			
			НС = тзДанные.Добавить();
			НС.НомерПроекта 		= Выборка.НомерПроекта;
			НС.НаименованиеПроекта 	= Выборка.НаименованиеПроекта;
			НС.СуффикПроекта		= Выборка.Префикс;
			НС.ID_PDM 				= Формат(Выборка.ID_PDM, "ЧГ=0");
			НС.Код1С 				= Выборка.Код1С;
			
		КонецЦикла;
		
		
		НаименованиеЭлемента = "Project";
		
	ИначеЕсли ТипВыгрузки = "Комплект" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент.Наименование КАК НаименованиеИзделия,
		|	ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент.Помещения.НомерПомещения КАК НомерПомещения,
		|	ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент.НомерПоПорядку КАК НомерИзделия,
		|	ИзделияКомплектИзделияЗаказчика.ИзделиеЭлемент.Код КАК Код1С
		|ИЗ
		|	Справочник.ИзделияКомплект.ИзделияЭлемент КАК ИзделияКомплектИзделияЗаказчика
		|ГДЕ
		|	ИзделияКомплектИзделияЗаказчика.Ссылка = &ОбъектТЗ
		|	И ИзделияКомплектИзделияЗаказчика.Основное
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ИзделияКомплект.Проект.Наименование, """") КАК НаименованиеПроекта,
		|	ИзделияКомплект.НаименованиеКомплекта КАК НаименованиеКомплекта,
		|	ЕСТЬNULL(ИзделияКомплект.Проект.Номер, """") КАК НомерПроекта,
		|	ИзделияКомплект.Код КАК Код1С,
		|	ЕСТЬNULL(ИзделияКомплект.ОсновноеПомещение.НомерПомещения, """") КАК ОсновноеПомещениеКод
		|ИЗ
		|	Справочник.ИзделияКомплект КАК ИзделияКомплект
		|ГДЕ
		|	ИзделияКомплект.Ссылка = &ОбъектТЗ";
		
		Запрос.УстановитьПараметр("ОбъектТЗ", ЭлементВыгрузки);
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Выборка = РезультатЗапроса[1].Выбрать();
		
		НаименованиеПроекта 	= "";
		НомерПроекта 			= "";
		НаименованиеКомплекта 	= "";
		Код1С 					= "";
		ОсновноеПомещениеКод	= "";
		НомерИзделия			= "";
		
		Пока Выборка.Следующий() Цикл
			НаименованиеПроекта 	= ПолучитьКорректноеНаименование(Выборка.НаименованиеПроекта);
			НомерПроекта 			= Выборка.НомерПроекта;
			НаименованиеКомплекта 	= ПолучитьКорректноеНаименование(Выборка.НаименованиеКомплекта);
			Код1С 					= Выборка.Код1С;
			ОсновноеПомещениеКод	= Выборка.ОсновноеПомещениеКод;
		КонецЦикла;
		
		
		тзДанные.Колонки.Добавить("НомерПроекта", 			ТипСтрока); 
		тзДанные.Колонки.Добавить("НаименованиеПроекта", 	ТипСтрока); 
		тзДанные.Колонки.Добавить("НомерПомещения", 		ТипСтрока); 
		тзДанные.Колонки.Добавить("НомерИзделия", 			ТипСтрока); 
		тзДанные.Колонки.Добавить("НаименованиеИзделия",	ТипСтрока); 
		тзДанные.Колонки.Добавить("Код1С", 					ТипСтрока); 
		
		НС = тзДанные.Добавить();
		НС.НомерПроекта 		= НомерПроекта;
		НС.НаименованиеПроекта 	= НаименованиеПроекта;
		НС.НомерПомещения		= ОсновноеПомещениеКод;
		НС.НомерИзделия 		= "";
		НС.НаименованиеИзделия 	= НаименованиеКомплекта;
		НС.Код1С 				= Код1С;
		
		Выборка = РезультатЗапроса[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			НС.НомерИзделия 		= Формат(Выборка.НомерИзделия, "ЧЦ=3; ЧВН=");
		КонецЦикла; 
		
		НаименованиеЭлемента = "ProjectSynchro";
		
	ИначеЕсли ТипВыгрузки = "Конструктор" Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеСотрудникаВPDM.Username КАК Username,
			|	ИзделияКомплект.НаименованиеКомплекта КАК Наименование,
			|	ИзделияКомплект.Код КАК Код,
			|	ЕСТЬNULL(ДатыКомплекта.Код_в_PDM, 0) КАК Код_в_PDM
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка),
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ЭлементВыгрузки) КАК ДанныеКомплектаСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
			|		ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудникаВPDM.Сотрудник
			|ГДЕ
			|	ИзделияКомплект.Ссылка = &ЭлементВыгрузки";
		
		Запрос.УстановитьПараметр("ЭлементВыгрузки", ЭлементВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Username 	= Неопределено;
		Код_в_PDM 	= Неопределено;
		
		Пока Выборка.Следующий() Цикл
			Username 				= Выборка.Username;
			ID_1С_Изделия			= Выборка.Код;
			НаименованиеКомплекта 	= Выборка.Наименование;
			Код_в_PDM 				= Формат(Выборка.Код_в_PDM, "ЧГ=0");
		КонецЦикла;
		
		НаименованиеЭлемента 	= "SetKonstruktor";	
		
		Если ЗначениеЗаполнено(Username) Тогда
			стДанныеКомплекта = омИзделиеКомплект.ПолучитьДанныеДляНомераКомплекта(ЭлементВыгрузки);
			ТипЧисло = Новый ОписаниеТипов("Число");
			
			Если НЕ стДанныеКомплекта = Неопределено Тогда
				
				тзДанные.Колонки.Добавить("НомерПроекта", 			ТипСтрока); 
				тзДанные.Колонки.Добавить("НомерПомещения", 		ТипСтрока); 
				тзДанные.Колонки.Добавить("НомерИзделия", 			ТипСтрока); 
				тзДанные.Колонки.Добавить("НаименованиеИзделия",	ТипСтрока); 
				тзДанные.Колонки.Добавить("Код1С", 					ТипСтрока); 
				тзДанные.Колонки.Добавить("Конструктор",			ТипСтрока); 
				тзДанные.Колонки.Добавить("Код_в_PDM",				ТипСтрока); 
				тзДанные.Колонки.Добавить("Отменить",				ТипЧисло); 
				
				НС = тзДанные.Добавить();
				НС.НомерПроекта 		= стДанныеКомплекта.НомерПроекта;
				НС.НомерПомещения		= стДанныеКомплекта.НомерПомещения;
				НС.НомерИзделия 		= стДанныеКомплекта.НомерИзделия;
				НС.НаименованиеИзделия 	= НаименованиеКомплекта;
				НС.Код1С 				= ID_1С_Изделия;
				НС.Конструктор			= Username;
				НС.Код_в_PDM 			= Формат(Выборка.Код_в_PDM, "ЧГ=0");
				
				Если ПараметрыВыгрузки = Неопределено Тогда
					НС.Отменить			= 0;
				Иначе	
					НС.Отменить			= ПараметрыВыгрузки.Отменить;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипВыгрузки = "Композиция" Тогда
		
		тзДанные.Колонки.Добавить("Код1С",						ТипСтрока); 
		тзДанные.Колонки.Добавить("IDПроекта", 					ТипСтрока); 
		тзДанные.Колонки.Добавить("НаименованиеКомпозиции",		ТипСтрока); 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Композиции.Код КАК Код1С,
			|	Композиции.Наименование КАК НаименованиеКомпозиции,
			|	ЕСТЬNULL(ДанныеПроекта.Код_в_PDM, """") КАК IDПроекта
			|ИЗ
			|	Справочник.Композиции КАК Композиции
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроекта КАК ДанныеПроекта
			|		ПО Композиции.Проект = ДанныеПроекта.Проект
			|ГДЕ
			|	Композиции.Ссылка = &ЭлементВыгрузки";
		
		Запрос.УстановитьПараметр("ЭлементВыгрузки", ЭлементВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Код1С 					= "";
		IDПроекта 				= "";
		НаименованиеКомпозиции 	= "";
		
		Пока Выборка.Следующий() Цикл
			Код1С 					= Выборка.Код1С;
			IDПроекта 				= Выборка.IDПроекта;
			НаименованиеКомпозиции	= Выборка.НаименованиеКомпозиции;
		КонецЦикла;
		
		НС = тзДанные.Добавить();
		НС.Код1С 					= Код1С;
		НС.IDПроекта 				= IDПроекта;
		НС.НаименованиеКомпозиции	= НаименованиеКомпозиции;
		
		
		НаименованиеЭлемента = "CompositionSynchro";
		
	ИначеЕсли ТипВыгрузки = "ГабаритныйЧертеж" Тогда
		
		тзДанные.Колонки.Добавить("Код1С",			ТипСтрока); 
		тзДанные.Колонки.Добавить("Наименование", 	ТипСтрока); 
		тзДанные.Колонки.Добавить("IDПроекта", 		ТипСтрока); 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ДанныеПроекта.Код_в_PDM, 0) КАК IDПроекта,
			|	ГабаритныеЧертежи.Код КАК Код1С,
			|	ГабаритныеЧертежи.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ГабаритныеЧертежи КАК ГабаритныеЧертежи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПроекта КАК ДанныеПроекта
			|		ПО ГабаритныеЧертежи.Проект = ДанныеПроекта.Проект
			|ГДЕ
			|	ГабаритныеЧертежи.Ссылка = &ЭлементВыгрузки";
		
		Запрос.УстановитьПараметр("ЭлементВыгрузки", ЭлементВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Код1С 			= "";
		Наименование 	= "";
		IDПроекта 		= "";      	
		
		Пока Выборка.Следующий() Цикл
			Код1С 					= Выборка.Код1С;
			Наименование 			= Выборка.Наименование;
			IDПроекта 				= Формат(Выборка.IDПроекта, "ЧГ=0");
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(IDПроекта) Тогда 
			
			НС = тзДанные.Добавить();
			НС.Код1С 					= Код1С;
			НС.Наименование				= Наименование;
			НС.IDПроекта 				= IDПроекта;
		
		КонецЕсли;
		
		НаименованиеЭлемента = "GhSynchro2";
		
	ИначеЕсли ТипВыгрузки = "СтатусГЧ" Тогда
		
		
		ID_GH 			= "";
		ID_1C 			= "";
		Status 			= "";
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СостояниеЗамераСрезПоследних.СтатусЗамера КАК Status,
			|	СостояниеЗамераСрезПоследних.ОбъектЗамера.Код КАК ID_1C,
			|	ЕСТЬNULL(ДанныеГабаритныйЧертеж.Код_в_PDM, ""0"") КАК ID_GH
			|ИЗ
			|	РегистрСведений.СостояниеЗамера.СрезПоследних(, ОбъектЗамера = &ОбъектЗамера) КАК СостояниеЗамераСрезПоследних
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеГабаритныйЧертеж КАК ДанныеГабаритныйЧертеж
			|		ПО ((ВЫРАЗИТЬ(СостояниеЗамераСрезПоследних.ОбъектЗамера КАК Справочник.ГабаритныеЧертежи)) = ДанныеГабаритныйЧертеж.ГабаритныйЧертеж)";
		
		Запрос.УстановитьПараметр("ОбъектЗамера", ЭлементВыгрузки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ID_GH 	= Формат(Выборка.ID_GH, "ЧГ=0");	
			ID_1C 	= Выборка.ID_1C;	
			Status 	= ?(Выборка.Status = Перечисления.СтатусыЗамера.Рабочий, "1", "0");	
		КонецЦикла;
		
		тзДанные.Колонки.Добавить("Status",	ТипСтрока); 
		тзДанные.Колонки.Добавить("ID_1C", 	ТипСтрока); 
		тзДанные.Колонки.Добавить("ID_GH", 	ТипСтрока); 

			
		Если НЕ ПустаяСтрока(ID_GH) Тогда 
			
			НС = тзДанные.Добавить();
			НС.ID_GH	= ID_GH;
			НС.ID_1C	= ID_1C;
			НС.Status	= Status;
		
		КонецЕсли;
		
		НаименованиеЭлемента = "StateChangerGH";
			
	ИначеЕсли ТипВыгрузки = "ЗагрузкаТЗ" Тогда
		
		
		Код_в_PDM		= "";
		ID_1C 			= "";
		Path 			= ПараметрыВыгрузки.ПолноеИмяФайла;
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ЭлементВыгрузки", ЭлементВыгрузки);
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM,
			|	ДатыКомплекта.Комплект.Код КАК ID_1C
			|ИЗ
			|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|ГДЕ
			|	ДатыКомплекта.Комплект = &ЭлементВыгрузки";
		
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Код_в_PDM 		= Формат(Выборка.Код_в_PDM, "ЧГ=0");
			Тип_справочника = ?(Тип("СправочникСсылка.Композиции") = ТипЗнч(ЭлементВыгрузки), "C", "S");
			ID_1C 			= Тип_справочника + Формат(Выборка.ID_1C, "ЧГ=0");	
		КонецЦикла;
		
		тзДанные.Колонки.Добавить("Тип_справочника",	ТипСтрока); 
		тзДанные.Колонки.Добавить("Код_в_PDM",			ТипСтрока); 
		тзДанные.Колонки.Добавить("ID_1C", 				ТипСтрока); 
		тзДанные.Колонки.Добавить("Path", 				ТипСтрока); 

			
		Если НЕ ПустаяСтрока(Код_в_PDM) Тогда 
			
			НС = тзДанные.Добавить();
			НС.Тип_справочника	= Тип_справочника;
			НС.Код_в_PDM		= Код_в_PDM;
			НС.ID_1C			= ID_1C;
			НС.Path				= Path;
		
		КонецЕсли;
		
		НаименованиеЭлемента = "TechnicalTask";
			
	ИначеЕсли ТипВыгрузки = "КонтрольРегистрации" Тогда
		
		
		Код_в_PDM		= "";
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ЭлементВыгрузки", ЭлементВыгрузки);
	
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
			|ИЗ
			|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|ГДЕ
			|	ДатыКомплекта.Комплект = &ЭлементВыгрузки";
		
	
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Код_в_PDM 		= Формат(Выборка.Код_в_PDM, "ЧГ=0");
		КонецЦикла;
		
		тзДанные.Колонки.Добавить("ID",	ТипСтрока); 
			
		Если НЕ ПустаяСтрока(Код_в_PDM) Тогда 
			
			НС 		= тзДанные.Добавить();
			НС.ID	= Код_в_PDM;
		
		КонецЕсли;
		
		НаименованиеЭлемента = "GetProductCheckOutFiles";
			
	ИначеЕсли ТипВыгрузки = "РаздатьПрава" ИЛИ ТипВыгрузки = "ЗабратьПрава" Тогда
		ID_PDM 		= "";
		UsrName 	= "";
		
		тзДанные.Колонки.Добавить("ID_PDM",		ТипСтрока); 
		тзДанные.Колонки.Добавить("UsrName",	ТипСтрока); 
		
		Запрос = Новый Запрос;
		ОбъектТЗ = ЭлементВыгрузки.ОбъектТЗ;
		
		Если ТипЗнч(ОбъектТЗ) = Тип("СправочникСсылка.Композиции") Тогда
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеСотрудникаВPDM.Username КАК Username,
			|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
			|ИЗ
			|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект = &ОбъектТЗ) КАК ДанныеКомплектаСрезПоследних
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
			|		ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудникаВPDM.Сотрудник,
			|	РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|ГДЕ
			|	ДатыКомплекта.Комплект = &ОбъектТЗ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM,
			|	ДанныеСотрудникаВPDM.Username КАК Username
			|ИЗ
			|	Справочник.ИзделияКомплект КАК ИзделияКомплект
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|		ПО (ДатыКомплекта.Комплект = ИзделияКомплект.Ссылка)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
			|			ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудникаВPDM.Сотрудник
			|		ПО (ДанныеКомплектаСрезПоследних.Комплект = ИзделияКомплект.Ссылка)
			|ГДЕ
			|	ИзделияКомплект.Родитель.Композиция = &ОбъектТЗ";
			
			Запрос.УстановитьПараметр("ОбъектТЗ", ОбъектТЗ);
			Результат = Запрос.ВыполнитьПакет();
			
			Выборка = Результат[0].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НС = тзДанные.Добавить();
				НС.ID_PDM 	= Формат(Выборка.Код_в_PDM, "ЧГ=0");
				НС.UsrName 	= Выборка.Username;	
			КонецЦикла;
			Выборка = Результат[1].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				НС = тзДанные.Добавить();
				НС.ID_PDM 	= Формат(Выборка.Код_в_PDM, "ЧГ=0");
				НС.UsrName 	= Выборка.Username;	
			КонецЦикла;
		Иначе
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеСотрудникаВPDM.Username КАК Username,
			|	ДатыКомплекта.Код_в_PDM КАК Код_в_PDM
			|ИЗ
			|	Задача.Задачи_ПКД КАК Задачи_ПКД
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКомплекта.СрезПоследних КАК ДанныеКомплектаСрезПоследних
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДанныеСотрудникаВPDM КАК ДанныеСотрудникаВPDM
			|			ПО ДанныеКомплектаСрезПоследних.Конструктор = ДанныеСотрудникаВPDM.Сотрудник
			|		ПО Задачи_ПКД.ОбъектТЗ = ДанныеКомплектаСрезПоследних.Комплект
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКомплекта КАК ДатыКомплекта
			|		ПО Задачи_ПКД.ОбъектТЗ = ДатыКомплекта.Комплект
			|ГДЕ
			|	Задачи_ПКД.Ссылка = &ЭлементВыгрузки";
			
			Запрос.УстановитьПараметр("ЭлементВыгрузки", ЭлементВыгрузки);
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				ID_PDM 		= Формат(Выборка.Код_в_PDM, "ЧГ=0");
				UsrName 	= Выборка.Username;	
			КонецЦикла;
			
			Если ПустаяСтрока(ID_PDM) Тогда
				ОписаниеОшибки =  "Не удалось получить код PDM";
			ИначеЕсли ПустаяСтрока(UsrName) Тогда
				ОписаниеОшибки = "Не удалось получить код конструктора";
			Иначе
				НС = тзДанные.Добавить();
				НС.ID_PDM	= ID_PDM;
				НС.UsrName	= UsrName;
				
			КонецЕсли;
		КонецЕсли;
		
		НаименованиеЭлемента = ?(ТипВыгрузки = "ЗабратьПрава", "UpdatePermissions", "MovePermissions");

	КонецЕсли; 
		
	Возврат Новый Структура("НаименованиеЭлемента, мДанныеЭлемента, Ошибка", НаименованиеЭлемента, ОбщегоНазначения.ТаблицаЗначенийВМассив(тзДанные), ОписаниеОшибки);
	
КонецФункции // ПолучитьДанныеКомплекта()         

Функция ПолучитьКорректноеНаименование(текСтрока)
	Возврат текСтрока;
	//Возврат омРаботаССтроками.ВернутьТолькоБуквыИЦифры(СтрЗаменить(текСтрока," ","_"),,".");	
	
КонецФункции // ПолучитьКорректноеНаименование()

Функция ПолучитьДанныеВыгрузки() Экспорт
	
	мНастроек = омВыгрузкаCRMНаСевере.ПолучитьНаименованиеНастроек();
	стДанныеВыгрузки = Новый Структура();
	
	Для каждого х Из мНастроек Цикл
		стДанныеВыгрузки.Вставить(х,"");
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
		|	НастройкиПроекта.ИмяНастройки КАК ИмяНастройки,
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки В(&ИмяНастройки)
		|	И НастройкиПроекта.Пользователь = &Пользователь
		|	И НастройкиПроекта.НомерНастройки = 0";
		
	Запрос.УстановитьПараметр("ИмяНастройки", мНастроек);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		стДанныеВыгрузки[Выборка.ИмяНастройки] = Выборка.Значение;
	КонецЦикла;
	
	стДанныеВыгрузки.Вставить("СчетчикПоискаФайлаОтветаВыгрузкиPDM", ПараметрыСеанса.СчетчикПоискаФайлаОтветаВыгрузкиPDM); 
	
	Возврат стДанныеВыгрузки;
	
КонецФункции // ПолучитьДанныеВыгрузки() 

Функция УстановитьСчетчикПоискаФайлаОтветаВыгрузкиPDM(Значение = Неопределено, УменьшитьНаЕдиницу = Истина) Экспорт

	Если НЕ Значение = Неопределено Тогда
		ПараметрыСеанса.СчетчикПоискаФайлаОтветаВыгрузкиPDM = Значение;
	ИначеЕсли УменьшитьНаЕдиницу Тогда	
		ПараметрыСеанса.СчетчикПоискаФайлаОтветаВыгрузкиPDM = ?(ПараметрыСеанса.СчетчикПоискаФайлаОтветаВыгрузкиPDM = 0
																, 0
																, ПараметрыСеанса.СчетчикПоискаФайлаОтветаВыгрузкиPDM - 1);
	КонецЕсли;
	
	Возврат ПараметрыСеанса.СчетчикПоискаФайлаОтветаВыгрузкиPDM;	
КонецФункции // УстановитьСчет()

Функция ВыгрузкаВБитриксРегламентнымЗаданием() Экспорт

	стВозврата = Новый Структура("ОписаниеОшибки,РезультатаВыгрузки","","");

	СтруктураНастроек =  Б24_К_ОбщегоНазначенияВызовСервера.СформироватьСтруктуруНастроек(Константы.НастройкаПодключенияКБитриксПоУмолчанию.Получить());  
	Если СтруктураНастроек = Неопределено Тогда
		стВозврата.ОписаниеОшибки = "Не настроен обмен с битрикс.";
		Возврат стВозврата;
	КонецЕсли;

	ПараметрыСинхронизации = Новый Структура("ВидСинхронизации,ВыполнятьВыгрузку,ВыполнятьЗагрузку,ПолнаяСинхронизация,НастройкаПодключения"
												,7,Истина,Истина,Истина,СтруктураНастроек.НастройкаПодключения);
	
  	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор());
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Выполнение синхронизации с Битрикс24'");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("Б24_СМ_ОбщегоНазначенияВызовСервера.ВыполнитьСинхронизациюПоФоновомуЗаданию", ПараметрыСинхронизации, ПараметрыВыполнения);

	стКудаВыгружалось = Новый Структура("ВPDM,ВБитрикс",Ложь,Истина);

КонецФункции // ВыгрузкаВБитриксРегламентнымЗаданием()

Процедура УстановитьОтметкуЗагрузкаPDM(КодКомплекта, ИмяСправочника) Экспорт

	
КонецПроцедуры // УстановитьОтметкуЗагрузка()

Функция ПолучитьКодБитрикс(Ссылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат "";
	КонецЕсли;
	
	УИД = Строка(Ссылка.УникальныйИдентификатор());
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Б24_СМ_ИдентификаторыОбъектов.Идентификатор КАК Идентификатор
		|ИЗ
		|	РегистрСведений.Б24_СМ_ИдентификаторыОбъектов КАК Б24_СМ_ИдентификаторыОбъектов
		|ГДЕ
		|	Б24_СМ_ИдентификаторыОбъектов.ИдентификаторОбъекта = &ИдентификаторОбъекта";
	
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", УИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Идентификатор;
	КонецЦикла;
	
	Возврат "";
	
КонецФункции // ПолучитьКодБитрикс()
